# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
#Your code here
import sqlite3
conn = sqlite3.connect("./data.sqlite")
c = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [4]:
#Your code here
import pandas as pd
c.execute(""" select firstname, lastname, city, state from employees join offices
            using(officeCode)
            order by firstname ASC, lastname ASC;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0]  for x in c.description]
df.head()

  firstName lastName           city state
0      Andy   Fixter         Sydney
1   Anthony      Bow  San Francisco    CA
2     Barry    Jones         London
3     Diane   Murphy  San Francisco    CA
4  Foon Yue    Tseng            NYC    NY

## Customers and their Orders (a One-to-Many join)

Return a list of all the customers first and last names along with a record for each of their order numbers, order dates and statuses.

In [7]:
# Your code here
c.execute(""" select customername, ordernumber, orderdate, status from customers join orders
            using(customernumber)
            order by customername DESC;""")
df_cust = pd.DataFrame(c.fetchall())
df_cust.columns = [x[0]  for x in c.description]
print(f"Number of Rows: {len(df_cust)}")
df_cust.head()

Number of Rows: 326

                  customerName orderNumber   orderDate   status
0            giftsbymail.co.uk       10232  2004-03-20  Shipped
1            giftsbymail.co.uk       10316  2004-11-01  Shipped
2  West Coast Collectables Co.       10199  2003-12-01  Shipped
3  West Coast Collectables Co.       10215  2004-01-29  Shipped
4     Volvo Model Replicas, Co       10112  2003-03-24  Shipped

## Customers and their Payments (another One-to-Many join)

Return a list of customers first and last names along with details about their payments including the amount and date of payments. Sort these results in descending order by the payment amount.

In [9]:
# Your code here
c.execute(""" select customername, paymentdate, amount from customers join payments
            using(customernumber)
            order by customername ASC;""")
df_cust = pd.DataFrame(c.fetchall())
df_cust.columns = [x[0]  for x in c.description]
print(f"Number of Rows: {len(df_cust)}")
df_cust.head()

Number of Rows: 273

     customerName paymentDate    amount
0  AV Stores, Co.  2003-03-27  48425.69
1  AV Stores, Co.  2004-11-03  52825.29
2  AV Stores, Co.  2004-12-08  47159.11
3    Alpha Cognac  2003-07-21  14232.70
4    Alpha Cognac  2003-11-22  33818.34

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [10]:
# Your code here
c.execute(""" select customername, contactfirstname, contactlastname, 
            productname, quantityordered, orderdate
            from customers c join orders o
            using(customernumber)
            join orderdetails od
            using(ordernumber)
            join products p
            using(productcode)
            order by customername ASC;""")
df_ord_prod = pd.DataFrame(c.fetchall())
df_ord_prod.columns = [x[0]  for x in c.description]
print(f"Number of Rows: {len(df_ord_prod)}")
df_ord_prod.head()

Number of Rows: 2996

,customerName,contactFirstName,contactLastName,productName,quantityOrdered,orderDate
0,"AV Stores, Co.",Rachel,Ashworth,1965 Aston Martin DB5,37,2003-03-18
1,"AV Stores, Co.",Rachel,Ashworth,1917 Grand Touring Sedan,42,2003-03-18
2,"AV Stores, Co.",Rachel,Ashworth,1911 Ford Town Car,32,2003-03-18
3,"AV Stores, Co.",Rachel,Ashworth,1932 Model A Ford J-Coupe,33,2003-03-18
4,"AV Stores, Co.",Rachel,Ashworth,1928 Mercedes-Benz SSK,31,2003-03-18

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!